#coding: utf-8
Задание 1
x = int (input("введите x"))
y = 7*x+5
print (y)

Задание 2
w = int (input("введите w"))
e = w*4
print (e)

Задание 3
p = 3.14
r = int(input("Введите r ="))
e = (p*2)*r
print (e)

Задание 4
p = 3.14
d = int(input("Введите d"))
R = d/2
u=i*R**R
print (u)