#coding: utf-8
#Задание №2
a=int(input("Введите a="))
b=int(input("Введите b="))
for i in range(a+1,b):
    print(i,end=" ")
#Задание №3
#coding: utf-8
a=int(input("Введите a="))
b=int(input("Введите b="))
for i in range(b-1,a,-1):
    print(i,end=" ")